[Survived] StringLiteral
src/app/books/books.component.ts:15:19
 export class BooksComponent implements OnInit {
 
   book$ = this.store.pipe(select(selectBooks));
-  title: string = '';
+  title: string = "Stryker was here!";
   constructor(private store: Store) { }
 

[Survived] BlockStatement
src/app/books/books.component.ts:18:20
   title: string = '';
   constructor(private store: Store) { }
 
-  ngOnInit(): void {
-    this.store.dispatch(invokeBooksAPI());
-  }
+  ngOnInit(): void {}
 
   addBook() {

[Survived] BlockStatement
src/app/books/books.component.ts:22:13
     this.store.dispatch(invokeBooksAPI());
   }
 
-  addBook() {
-    const newBook: IBook = {
-      id: 0,
-      title: this.title,
-      author: '',
-      cost: 0
-    };
-    this.title = '';
-    this.store.dispatch(invokeSaveBookAPI({ book: newBook }));
-  }
+  addBook() {}
 
   deleteBook(book: IBook) {

[Survived] ObjectLiteral
src/app/books/books.component.ts:30:43
       cost: 0
     };
     this.title = '';
-    this.store.dispatch(invokeSaveBookAPI({ book: newBook }));
+    this.store.dispatch(invokeSaveBookAPI({}));
   }
 

[NoCoverage] BlockStatement
src/app/books/books.component.ts:33:27
     this.store.dispatch(invokeSaveBookAPI({ book: newBook }));
   }
 
-  deleteBook(book: IBook) {
-    this.store.dispatch(invokeDeleteBookAPI({ book: book }));
-  }
+  deleteBook(book: IBook) {}
 
 }
