[NoCoverage] ArrowFunction
app/store/books/books.effects.ts:11:31
 export class BooksEffects {
     constructor(private action$: Actions, private booksService: BooksService) {}
 
-    loadBooks$ = createEffect(() => this.action$.pipe(
-        ofType(invokeBooksAPI),
-        switchMap(() => {
-            return this.booksService
-                .getBooks()
-                    .pipe(
-                        map((books) => booksAPISuccess({ 
-                            books: books 
-                        })
-                    )
-                )
-        })
-    ));
+    loadBooks$ = createEffect(() => undefined);
 
     saveBook$ = createEffect(() => this.action$.pipe(

[NoCoverage] BlockStatement
app/store/books/books.effects.ts:13:25
 
     loadBooks$ = createEffect(() => this.action$.pipe(
         ofType(invokeBooksAPI),
-        switchMap(() => {
-            return this.booksService
-                .getBooks()
-                    .pipe(
-                        map((books) => booksAPISuccess({ 
-                            books: books 
-                        })
-                    )
-                )
-        })
+        switchMap(() => {})
     ));
 

[NoCoverage] ArrowFunction
app/store/books/books.effects.ts:17:29
             return this.booksService
                 .getBooks()
                     .pipe(
-                        map((books) => booksAPISuccess({ 
-                            books: books 
-                        })
+                        map(() => undefined
                     )
                 )

[NoCoverage] ArrowFunction
app/store/books/books.effects.ts:25:30
         })
     ));
 
-    saveBook$ = createEffect(() => this.action$.pipe(
-        ofType(invokeSaveBookAPI),
-        switchMap((action) => {
-            return this.booksService
-                .saveBook(action.book)
-                    .pipe(
-                        map((book) => bookSaveAPISuccess({
-                            book: book
-                        })
-                    )
-                )
-        })
-    ));
+    saveBook$ = createEffect(() => undefined);
 
     deleteBook$ = createEffect(() => this.action$.pipe(

[NoCoverage] BlockStatement
app/store/books/books.effects.ts:27:31
 
     saveBook$ = createEffect(() => this.action$.pipe(
         ofType(invokeSaveBookAPI),
-        switchMap((action) => {
-            return this.booksService
-                .saveBook(action.book)
-                    .pipe(
-                        map((book) => bookSaveAPISuccess({
-                            book: book
-                        })
-                    )
-                )
-        })
+        switchMap((action) => {})
     ));
 

[NoCoverage] ArrowFunction
app/store/books/books.effects.ts:31:29
             return this.booksService
                 .saveBook(action.book)
                     .pipe(
-                        map((book) => bookSaveAPISuccess({
-                            book: book
-                        })
+                        map(() => undefined
                     )
                 )

[NoCoverage] ObjectLiteral
app/store/books/books.effects.ts:31:58
             return this.booksService
                 .saveBook(action.book)
                     .pipe(
-                        map((book) => bookSaveAPISuccess({
-                            book: book
-                        })
+                        map((book) => bookSaveAPISuccess({})
                     )
                 )

[NoCoverage] ArrowFunction
app/store/books/books.effects.ts:39:32
         })
     ));
 
-    deleteBook$ = createEffect(() => this.action$.pipe(
-        ofType(invokeDeleteBookAPI),
-        switchMap((action) => {
-            return this.booksService
-                .deleteBook(action.book)
-                    .pipe(
-                        map(() => bookDeleteAPISuccess({
-                            book: action.book
-                        }))
-                    )
-        })
-    ))
+    deleteBook$ = createEffect(() => undefined)
 }

[NoCoverage] BlockStatement
app/store/books/books.effects.ts:41:31
 
     deleteBook$ = createEffect(() => this.action$.pipe(
         ofType(invokeDeleteBookAPI),
-        switchMap((action) => {
-            return this.booksService
-                .deleteBook(action.book)
-                    .pipe(
-                        map(() => bookDeleteAPISuccess({
-                            book: action.book
-                        }))
-                    )
-        })
+        switchMap((action) => {})
     ))
 }

[NoCoverage] ArrowFunction
app/store/books/books.effects.ts:45:29
             return this.booksService
                 .deleteBook(action.book)
                     .pipe(
-                        map(() => bookDeleteAPISuccess({
-                            book: action.book
-                        }))
+                        map(() => undefined)
                     )
         })
