[NoCoverage] ArrowFunction
app/store/books/books.reducer.ts:9:25
 
 export const bookReducer = createReducer(
     initialState,
-    on(booksAPISuccess, (state, { books }) => books),
+    on(booksAPISuccess, () => undefined),
     on(bookSaveAPISuccess, (state, { book }) => {
         const newState = [...state];

[NoCoverage] BlockStatement
app/store/books/books.reducer.ts:10:49
 export const bookReducer = createReducer(
     initialState,
     on(booksAPISuccess, (state, { books }) => books),
-    on(bookSaveAPISuccess, (state, { book }) => {
-        const newState = [...state];
-        newState.push(book);
-        return newState;
-    }),
+    on(bookSaveAPISuccess, (state, { book }) => {}),
     on(bookDeleteAPISuccess, (state, { book }) => {
         const newState = [...state];

[NoCoverage] BlockStatement
app/store/books/books.reducer.ts:15:51
         newState.push(book);
         return newState;
     }),
-    on(bookDeleteAPISuccess, (state, { book }) => {
-        const newState = [...state];
-        const idx = newState.indexOf(book);
-        newState.splice(idx, 1);
-        return newState;
-    })
+    on(bookDeleteAPISuccess, (state, { book }) => {})
 );
