[NoCoverage] BlockStatement
app/store/books/books.service.ts:13:35
 
   constructor(private http: HttpClient) { }
 
-  getBooks(): Observable<IBook[]> {
-    return this.http.get<IBook[]>('http://localhost:3000/books');
-  }
+  getBooks(): Observable<IBook[]> {}
 
   saveBook(book: IBook): Observable<IBook> {

[NoCoverage] BlockStatement
app/store/books/books.service.ts:17:44
     return this.http.get<IBook[]>('http://localhost:3000/books');
   }
 
-  saveBook(book: IBook): Observable<IBook> {
-    return this.http.post<IBook>('http://localhost:3000/books', book);
-  }
+  saveBook(book: IBook): Observable<IBook> {}
 
   deleteBook(book: IBook): Observable<number> {

[NoCoverage] BlockStatement
app/store/books/books.service.ts:21:47
     return this.http.post<IBook>('http://localhost:3000/books', book);
   }
 
-  deleteBook(book: IBook): Observable<number> {
-    return this.http.delete<number>(`http://localhost:3000/books/${book.id}`);
-  }
+  deleteBook(book: IBook): Observable<number> {}
 }
 

[NoCoverage] StringLiteral
app/store/books/books.service.ts:22:37
   }
 
   deleteBook(book: IBook): Observable<number> {
-    return this.http.delete<number>(`http://localhost:3000/books/${book.id}`);
+    return this.http.delete<number>(``);
   }
 }
